Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20J15B.atdf
        <register name="VREF" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="VREF Control A">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="BGOUTEN" caption="Bandgap Output Enable" mask="0x4"/>
          <bitfield name="CALIB" caption="Voltage Reference Calibration Value" mask="0x7FF0000"/>
        </register>
      </register-group>
    </module>
    <module name="TC" id="U2212" version="1.1.2" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
        <register-group name="COUNT16" name-in-module="TC_COUNT16" union-tag-value="0" offset="0"/>
        <register-group name="COUNT32" name-in-module="TC_COUNT32" union-tag-value="2" offset="0"/>
      </register-group>
      <register-group name="TC_COUNT8" caption="Basic Timer Counter - 8-bit Counter Mode">
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="TC Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="WAVEGEN" caption="Waveform Generation Operation" mask="0x60" values="TC_CTRLA__WAVEGEN"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x3000" values="TC_CTRLA__PRESCSYNC"/>
        </register>
        <register name="READREQ" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Read Request">
          <bitfield name="ADDR" caption="Address" mask="0x1F"/>
          <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
          <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CTRLBCLR" initval="0x02" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xC0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="ONESHOT" caption="One-shot" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xC0" values="TC_CTRLBSET__CMD"/>
        </register>
        <register name="CTRLC" offset="0x6" rw="RW" size="1" initval="0x00" caption="Control C">
          <bitfield name="INVEN0" caption="Output Waveform 0 Invert Enable" mask="0x1"/>
          <bitfield name="INVEN1" caption="Output Waveform 1 Invert Enable" mask="0x2"/>
          <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x10"/>
          <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x20"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run Mode" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0xA" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="EVACT" caption="Event Action" mask="0x7" values="TC_EVCTRL__EVACT"/>
          <bitfield name="TCINV" caption="TC Inverted Event Input" mask="0x10"/>
          <bitfield name="TCEI" caption="TC Event Input" mask="0x20"/>
          <bitfield name="OVFEO" caption="Overflow/Underflow Event Output Enable" mask="0x100"/>
          <bitfield name="MCEO0" caption="Match or Capture Channel 0 Event Output Enable" mask="0x1000"/>
          <bitfield name="MCEO1" caption="Match or Capture Channel 1 Event Output Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ERR" caption="Error" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0xF" rw="R" size="1" initval="0x08" caption="Status">
          <bitfield name="STOP" caption="Stop" mask="0x8"/>
          <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
